---
type: ScheduleSheetInstance
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# ScheduleSheetInstance

`Autodesk.Revit.DB.ScheduleSheetInstance` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Property | IsTitleblockRevisionSchedule | 2013 | `public bool IsTitleblockRevisionSchedule { get ; }` |
| Property | Parameter | — | `` |
| Property | Point | 2013 | `public XYZ Point { get ; set ; }` |
| Property | Rotation | 2013 | `public ViewportRotation Rotation { get ; set ; }` |
| Property | ScheduleId | 2013 | `public ElementId ScheduleId { get ; }` |
| Property | SegmentIndex | 2022.1 | `public int SegmentIndex { get ; set ; }` |